---
kind: method
id: M:Autodesk.Revit.DB.FamilyParameterSet.#ctor
source: html/87f92ee2-7560-ea25-d04a-de3e772043be.htm
---
# Autodesk.Revit.DB.FamilyParameterSet.#ctor Method

Initializes a new instance of the FamilyParameterSet class

## Syntax (C#)
```csharp
public FamilyParameterSet()
```